Flow Around Cylinder/Re 100/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * *a * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         350;

deltaT          0.05;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    residuals
    {
        type            residuals;
        functionObjectLibs ("libutilityFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;
        outputInterval  1;

        fields
        (
            p
            U
            k
            epsilon
        );
    }
forces
{
    type            forceCoeffs;
    libs            ("libforces.so");
    writeControl    timeStep;
    writeInterval   1;

    patches         (wall);
    rho             rhoInf;      // Indicates incompressible
    log             true;
    rhoInf          1.293;           // Redundant for incompressible
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         0.1376;
    lRef            0.4;        // Wheelbase length
    Aref            1.2566;        // Estimated
}
wallShearStress1
{
    type            wallShearStress;
    libs ("libfieldFunctionObjects.so");


    writePrecision  8;
    writeToFile     true;
    useUserTime     true;
    region          region0;
    enabled         true;
    log             true;a
    timeStart       0;
    timeEnd         350;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    timeStep;
    writeInterval   20;
}
pressure1
{
	type	pressure;
	libs	("libfieldFunctionObjects.so");
	mode	staticCoeff;
	calcTotal	no;
	calcCoeff	yes;
	pInf		0;
	UInf		(0.003528616 0 0);
	rhoInf		1.293;
	writeControl    timeStep;
        writeInterval   20;
} 
}


// ************************************************************************* //
